In [2]:
import warnings
warnings.simplefilter('ignore', FutureWarning)

import pandas as pd

In [3]:
table = [
  ['Jordan', 33593843662],    # 1st row
  ['Kazakhstan', 2.31876E+11 ],  # 2nd row
  ['Kenya', 54930813988 ], # and so on...
  ['Kiribati', 168951535 ],
  ['Kosovo', 7073021774]
]
table

[['Jordan', 33593843662],
 ['Kazakhstan', 231876000000.0],
 ['Kenya', 54930813988],
 ['Kiribati', 168951535],
 ['Kosovo', 7073021774]]

In [4]:
headings = ['Country name', 'GDP (US$)']
gdp = pd.DataFrame(columns=headings, data=table)

In [5]:
headings = ['Country name', 'Life expectancy (years)']
table = [
  ['India', 67.66041463],
  ['Kenya', 60.95378049],  
  ['Kosovo', 70.79756098],
  ['Angola', 51.86617073 ],
  ['Malawi', 61.466]

]
life = pd.DataFrame(columns=headings, data=table)
headings
table

[['India', 67.66041463],
 ['Kenya', 60.95378049],
 ['Kosovo', 70.79756098],
 ['Angola', 51.86617073],
 ['Malawi', 61.466]]

In [6]:
def roundToMillions (value):
    return round(value / 1000000)

In [7]:
def usdToGBP (usd):
    return usd / 1.564768

In [8]:
gdp

  Country name     GDP (US$)
0       Jordan  3.359384e+10
1   Kazakhstan  2.318760e+11
2        Kenya  5.493081e+10
3     Kiribati  1.689515e+08
4       Kosovo  7.073022e+09

# Merging using the left side, right side, inner, outer

In [9]:
pd.merge(gdp, life, on='Country name', how='left')

  Country name     GDP (US$)  Life expectancy (years)
0       Jordan  3.359384e+10                      NaN
1   Kazakhstan  2.318760e+11                      NaN
2        Kenya  5.493081e+10                60.953780
3     Kiribati  1.689515e+08                      NaN
4       Kosovo  7.073022e+09                70.797561

In [10]:
pd.merge(gdp, life, on='Country name', how='right')

  Country name     GDP (US$)  Life expectancy (years)
0        India           NaN                67.660415
1        Kenya  5.493081e+10                60.953780
2       Kosovo  7.073022e+09                70.797561
3       Angola           NaN                51.866171
4       Malawi           NaN                61.466000

In [11]:
pd.merge(gdp, life, on='Country name', how='inner')

  Country name     GDP (US$)  Life expectancy (years)
0        Kenya  5.493081e+10                60.953780
1       Kosovo  7.073022e+09                70.797561

In [12]:
pd.merge(gdp, life, on='Country name', how='outer')

  Country name     GDP (US$)  Life expectancy (years)
0       Jordan  3.359384e+10                      NaN
1   Kazakhstan  2.318760e+11                      NaN
2        Kenya  5.493081e+10                60.953780
3     Kiribati  1.689515e+08                      NaN
4       Kosovo  7.073022e+09                70.797561
5        India           NaN                67.660415
6       Angola           NaN                51.866171
7       Malawi           NaN                61.466000

constant

In [14]:
df = pd.DataFrame({'Country name': {0: 'Iraq', 1: 'Ireland', 2: 'Israel', 3: 'Morocco'},
                   'Life expectancy': {0: 69, 1: 81, 2: 82, 3: 73}})

print("Initial dataframe")


df['Year 2013'] = pd.Series([1 for x in range(len(df.index))])

print("Final dataframe")
display(df)

Initial dataframe
Final dataframe

  Country name  Life expectancy  Year 2013
0         Iraq               69          1
1      Ireland               81          1
2       Israel               82          1
3      Morocco               73          1